In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
matplotlib.rcParams["figure.figsize"]=(20,10)

In [2]:
df = pd.read_csv("Bengaluru_House_Data.csv")

In [3]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [4]:
df.shape

(13320, 9)

In [5]:
df.groupby("area_type")["area_type"].agg("count")

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [6]:
df.drop(["area_type","society","balcony","availability"],axis=1,inplace=True)

In [7]:
df.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [8]:
df = df.dropna()

In [9]:
df.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [10]:
df.shape

(13246, 5)

In [11]:
df["size"].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [12]:
df["bhk"] = df["size"].apply(lambda x: int(x.split(" ")[0]))

In [13]:
df.head()

                   location       size total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK       1056   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0   51.00    2

In [14]:
df.total_sqft.unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [15]:
def isFloat(x):
    try:
        float(x)
    except:
        return False;
    return True

In [16]:
df[~df["total_sqft"].apply(isFloat)].head(5)

               location   size   total_sqft  bath    price  bhk
30            Yelahanka  4 BHK  2100 - 2850   4.0  186.000    4
122              Hebbal  4 BHK  3067 - 8156   4.0  477.000    4
137  8th Phase JP Nagar  2 BHK  1042 - 1105   2.0   54.005    2
165            Sarjapur  2 BHK  1145 - 1340   2.0   43.490    2
188            KR Puram  2 BHK  1015 - 1540   2.0   56.800    2

In [17]:
def convert_sqft_to_num(x):
    token = x.split("-")
    if(len(token)==2):
        return (float(token[0])+float(token[1]))/2
    try:
        return float(x)
    except:
        return 0

In [18]:
convert_sqft_to_num('123-12323')

6223.0

In [19]:
convert_sqft_to_num('123123')

123123.0

In [20]:
df["total_sqft_n"] = df.total_sqft.apply(convert_sqft_to_num)

In [21]:
df.head()

,location,size,total_sqft,bath,price,bhk,total_sqft_n
0,Electronic City Phase II,2 BHK,1056,2.0,39.07,2,1056.0
1,Chikka Tirupathi,4 Bedroom,2600,5.0,120.00,4,2600.0
2,Uttarahalli,3 BHK,1440,2.0,62.00,3,1440.0
3,Lingadheeranahalli,3 BHK,1521,3.0,95.00,3,1521.0
4,Kothanur,2 BHK,1200,2.0,51.00,2,1200.0

In [22]:
df = df.drop(["total_sqft"],axis=1)

In [23]:
df.head(5)

                   location       size  bath   price  bhk  total_sqft_n
0  Electronic City Phase II      2 BHK   2.0   39.07    2        1056.0
1          Chikka Tirupathi  4 Bedroom   5.0  120.00    4        2600.0
2               Uttarahalli      3 BHK   2.0   62.00    3        1440.0
3        Lingadheeranahalli      3 BHK   3.0   95.00    3        1521.0
4                  Kothanur      2 BHK   2.0   51.00    2        1200.0

In [24]:
df1 = df.copy()

In [25]:
import math
df1["price_per_sqft"] = (df1["price"]*100000)/df1["total_sqft_n"]

In [26]:
df1.isnull().sum()
# df1.price_per_sqft = df1.price_per_sqft.apply(lambda x: math.ceil(x))

location          0
size              0
bath              0
price             0
bhk               0
total_sqft_n      0
price_per_sqft    0
dtype: int64

In [27]:
df1[df1.total_sqft_n.isnull()]

Empty DataFrame
Columns: [location, size, bath, price, bhk, total_sqft_n, price_per_sqft]
Index: []

In [28]:
df1.location = df1.location.apply(lambda x: x.strip())

In [29]:
location_stats = df1.groupby("location")["location"].agg("count").sort_values(ascending=False)

In [30]:
location_stats

location
Whitefield               535
Sarjapur  Road           392
Electronic City          304
Kanakpura Road           266
Thanisandra              236
                        ...
1 Giri Nagar               1
Kanakapura Road,           1
Kanakapura main  Road      1
Karnataka Shabarimala      1
whitefiled                 1
Name: location, Length: 1293, dtype: int64

In [31]:
len(location_stats[location_stats<=10])

1052

In [32]:
location_less_than_10 = location_stats[location_stats<=10]

In [33]:
location_less_than_10

location
Basapura                 10
1st Block Koramangala    10
Gunjur Palya             10
Kalkere                  10
Sector 1 HSR Layout      10
                         ..
1 Giri Nagar              1
Kanakapura Road,          1
Kanakapura main  Road     1
Karnataka Shabarimala     1
whitefiled                1
Name: location, Length: 1052, dtype: int64

In [34]:
len(df1.location.unique())

1293

In [35]:
df1.location = df.location.apply(lambda x: "others" if x in location_less_than_10 else x)

In [36]:
len(df1.location.unique())

283

In [37]:
df1 = df1[~(df.total_sqft_n/df.bhk<300)]

In [39]:
df1.shape

(12456, 7)

,location,size,bath,price,bhk,total_sqft_n,price_per_sqft
0,Electronic City Phase II,2 BHK,2.0,39.07,2,1056.0,3699.810606
1,Chikka Tirupathi,4 Bedroom,5.0,120.00,4,2600.0,4615.384615
2,Uttarahalli,3 BHK,2.0,62.00,3,1440.0,4305.555556
3,Lingadheeranahalli,3 BHK,3.0,95.00,3,1521.0,6245.890861
4,Kothanur,2 BHK,2.0,51.00,2,1200.0,4250.000000
...,...,...,...,...,...,...,...
13315,Whitefield,5 Bedroom,4.0,231.00,5,3453.0,6689.834926
13316,others,4 BHK,5.0,400.00,4,3600.0,11111.111111
13317,Raja Rajeshwari Nagar,2 BHK,2.0,60.00,2,1141.0,5258.545136
13318,Padmanabhanagar,4 BHK,4.0,488.00,4,4689.0,10407.336319
13319,Doddathoguru,1 BHK,1.0,17.00,1,550.0,3090.909091